EDT_Task_5_01/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.ПродажиПоНоменклатуре</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиПоКонтрагентам</registerRecords>
  <registerRecords>AccumulationRegister.Выручка</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Крнтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ТипДокументаРеализации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT_Task_5_01/src/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

	&НаКлиенте
	Процедура ТоварыНоменклатураПриИзменении(Элемент)
		СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
		СтрокаТабличнойЧасти.Цена = РаботаСДокументамиСервер.ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ТоварыКоличествоПриИзменении(Элемент)
		СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
		РаботаСДокументамиКлиент.РассчитатьСумму(СтрокаТабличнойЧасти);
		РаботаСДокументамиКлиент.ОбновитьСуммуДокумента(Объект);
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ТоварыЦенаПриИзменении(Элемент)
		СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
		РаботаСДокументамиКлиент.РассчитатьСумму(СтрокаТабличнойЧасти);
		РаботаСДокументамиКлиент.ОбновитьСуммуДокумента(Объект);
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ТоварыСуммаПриИзменении(Элемент)
		СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
		РаботаСДокументамиКлиент.РассчитатьЦену(СтрокаТабличнойЧасти);
		РаботаСДокументамиКлиент.ОбновитьСуммуДокумента(Объект);
	КонецПроцедуры

#КонецОбласти
